rouderaa/objecttracker/esp32camObjectTracker/lib/esp32cam/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <Arduino.h>

#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "page.h"
#include "detect.cpp"
#include "esp_heap_caps.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define LED_LEDC_GPIO 4 // configure LED pin
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
int level = 0;       // Flash led level
int red_level = 230; // filter level for red channel
int green_level = 160;
int blue_level = 210;
bool isStreaming = false;

#endif

typedef struct
{
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

#if CONFIG_LED_ILLUMINATOR_ENABLED
void enable_led(bool en)
{ // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
  {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  // Serial.printf("duty=%d\r\n", duty);
  ledcWrite(LED_LEDC_GPIO, duty);
  // ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  // ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
  Serial.printf("Set LED intensity to %d\r\n", duty);
}
#endif

/**
 * Draw a rectangle on a BMP image
 *
 * @param bmpData Pointer to the BMP image data
 * @param len Size of the BMP data in bytes
 * @param left X-coordinate of the left edge of the rectangle (in pixels)
 * @param top Y-coordinate of the top edge of the rectangle (in pixels)
 * @param right X-coordinate of the right edge of the rectangle (in pixels)
 * @param bottom Y-coordinate of the bottom edge of the rectangle (in pixels)
 * @return Error codes:
 * 0: Success
 * 1: Invalid BMP signature
 * 2: Unsupported bits per pixel (only 24-bit supported)
 * 3: Rectangle out of bounds
 * 4: Insufficient data length
 * 5: Null pointer provided
 */
int drawRect(uint8_t *bmpData, size_t len, int left, int top, int right, int bottom)
{
  // Check for null pointer
  if (bmpData == NULL)
  {
    return 5; // Null pointer provided
  }

  // Check if we have enough data for the header
  if (len < 54)
  {
    return 4; // Insufficient data length
  }

  // Check if we have a valid BMP file (should start with "BM")
  if (bmpData[0] != 'B' || bmpData[1] != 'M')
  {
    return 1; // Invalid BMP signature
  }

  // Extract important BMP header information
  int width = *(int *)&bmpData[18];
  int height = *(int *)&bmpData[22];
  if (height < 0)
    height = height * -1;
  int bitsPerPixel = *(short *)&bmpData[28];
  int dataOffset = *(int *)&bmpData[10];
  // Serial.printf("draw width = %d, height= %d\r\n", width, height);

  // Check if the image is 24-bit (3 bytes per pixel)
  if (bitsPerPixel != 24)
  {
    return 2; // Only 24-bit BMPs are supported
  }

  // Calculate row padding (rows are padded to multiple of 4 bytes)
  int rowPadding = (width * 3) % 4;
  if (rowPadding != 0)
  {
    rowPadding = 4 - rowPadding;
  }

  // Make sure the rectangle coordinates are valid
  if (left > right)
  {
    int temp = left;
    left = right;
    right = temp;
  }

  if (top > bottom)
  {
    int temp = top;
    top = bottom;
    bottom = temp;
  }

  // Make sure the rectangle fits within the image boundaries
  if (left < 0 || top < 0 || right >= width || bottom >= height)
  {
    Serial.printf(
      "left:%d top: %d right:%d width:%d bottom:%d height:%d\r\n",
      left, top, right, width, bottom, height
    );
    return 3; // Rectangle would be outside image boundaries
  }

  // Make sure we have enough data
  int expectedSize = dataOffset + (width * 3 + rowPadding) * height;
  if (len < expectedSize)
  {
    return 4; // BMP data is truncated
  }

  // Calculate width and height of the rectangle
  int rectWidth = right - left + 1;
  int rectHeight = bottom - top + 1;

  // Draw the rectangle (only the border)
  for (int j = 0; j < rectHeight; j++)
  {
    for (int i = 0; i < rectWidth; i++)
    {
      // Only draw if we're on the border of the rectangle
      if (j == 0 || j == (rectHeight - 1) || i == 0 || i == (rectWidth - 1))
      {
        // Calculate the position in the BMP data
        // Note: In BMP format, rows are stored bottom to top
        int row = height - (top + j) - 1;
        int pos = dataOffset + row * (width * 3 + rowPadding) + (left + i) * 3;

        // Set the BGR values (BMP uses BGR, not RGB)
        bmpData[pos] = 0;       // Blue component
        bmpData[pos + 1] = 255; // Green component
        bmpData[pos + 2] = 0;   // Red component
      }
    }
  }

  return 0; // Success
}

static esp_err_t bmp_handler(httpd_req_t *req);

extern bool getCalibration(
    uint8_t *buf, int buf_len,
    int &red_level, int &green_level, int &blue_level);

static esp_err_t calibrate_handler(httpd_req_t *req)
{
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

  fb = esp_camera_fb_get();
  if (!fb)
  {
    log_e("Camera capture failed");

    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);

  if (getCalibration(
          buf, buf_len,
          red_level, green_level, blue_level))
  {
    Serial.printf(
        "red_level:%d green_level:%d blue_level:%d\r\n",
        red_level, green_level, blue_level);
  }
  else
  {
    Serial.println("getCalibration error");
  }
  esp_camera_fb_return(fb);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t bmp_handler(httpd_req_t *req)
{
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

  fb = esp_camera_fb_get();
  if (!fb)
  {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

