rouderaa/objecttracker/esp32camObjectTracker/lib/esp32cam/app_httpd.cpp
  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);

  int left, top, right, bottom;

  // Detect largest area adhering to the color values and draw rectangle if found
  if (detect(
          buf, buf_len,
          red_level, green_level, blue_level,
          left, top, right, bottom))
  {
    int draw_error = drawRect(buf, buf_len, left, top, right, bottom);
    if (draw_error != 0)
    {
      Serial.printf("drawing error: %d\r\n", draw_error);
    }
  }

  esp_camera_fb_return(fb);
  if (!converted)
  {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);

  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
  return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index)
  {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
  {
    return 0;
  }
  j->len += len;
  return len;
}

// BMP header structure
typedef struct
{
  uint16_t signature;       // "BM"
  uint32_t fileSize;        // File size in bytes
  uint16_t reserved1;       // Reserved
  uint16_t reserved2;       // Reserved
  uint32_t dataOffset;      // Offset to image data
  uint32_t headerSize;      // Header size
  int32_t width;            // Image width
  int32_t height;           // Image height
  uint16_t planes;          // Number of color planes
  uint16_t bitsPerPixel;    // Bits per pixel
  uint32_t compression;     // Compression type
  uint32_t imageSize;       // Image size
  int32_t xPixelsPerMeter;  // Pixels per meter X
  int32_t yPixelsPerMeter;  // Pixels per meter Y
  uint32_t colorsUsed;      // Number of colors
  uint32_t colorsImportant; // Important colors
} BMPHeader;

static esp_err_t capture_handler(httpd_req_t *req)
{
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

  fb = esp_camera_fb_get();

  if (!fb)
  {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  // Timestamp
  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  static uint8_t *bmpBuffer = NULL;
  static size_t bmpLen;

  if (fb->format == PIXFORMAT_JPEG)
  {
    frame2bmp(fb, &bmpBuffer, &bmpLen);

    BMPHeader header;

    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  }
  else
  {
    // Convert to jpg and return
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
  }
  esp_camera_fb_return(fb);
  return res;
}

static esp_err_t stream_handler(httpd_req_t *req)
{
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame)
  {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK)
  {
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

  while (true)
  {
    fb = esp_camera_fb_get();
    if (!fb)
    {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    }
    else
    {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG)
      {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted)
        {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      }
      else
      {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
#if CONFIG_ESP_FACE_DETECT_ENABLED
    }
    else
    {
      if (fb->format == PIXFORMAT_RGB565
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
          && !recognition_enabled
#endif
      )
      {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        fr_ready = esp_timer_get_time();
#endif
#if TWO_STAGE
        std::list<dl::detect::result_t> &candidates = s1.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3});
        std::list<dl::detect::result_t> &results = s2.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3}, candidates);
#else
        std::list<dl::detect::result_t> &results = s1.infer((uint16_t *)fb->buf, {(int)fb->height, (int)fb->width, 3});
#endif
#if CONFIG_ESP_FACE_DETECT_ENABLED && ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        fr_face = esp_timer_get_time();
        fr_recognize = fr_face;
#endif
        if (results.size() > 0)
        {
          fb_data_t rfb;
          rfb.width = fb->width;
          rfb.height = fb->height;
          rfb.data = fb->buf;
          rfb.bytes_per_pixel = 2;
          rfb.format = FB_RGB565;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
          detected = true;
#endif
          draw_face_boxes(&rfb, &results, face_id);
        }
        s = fmt2jpg(fb->buf, fb->len, fb->width, fb->height, PIXFORMAT_RGB565, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!s)
        {
          log_e("fmt2jpg failed");
          res = ESP_FAIL;
        }
#if CONFIG_ESP_FACE_DETECT_ENABLED && ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        fr_encode = esp_timer_get_time();
#endif
      }
      else
      {
        out_len = fb->width * fb->height * 3;
        out_width = fb->width;
        out_height = fb->height;
        out_buf = (uint8_t *)malloc(out_len);
        if (!out_buf)
        {
          log_e("out_buf malloc failed");
          res = ESP_FAIL;
        }
        else
        {
          s = fmt2rgb888(fb->buf, fb->len, fb->format, out_buf);
          esp_camera_fb_return(fb);
          fb = NULL;
          if (!s)
          {
            free(out_buf);
            log_e("To rgb888 failed");
            res = ESP_FAIL;
          }
          else
          {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
            fr_ready = esp_timer_get_time();
#endif

            fb_data_t rfb;
            rfb.width = out_width;
            rfb.height = out_height;
            rfb.data = out_buf;
            rfb.bytes_per_pixel = 3;
            rfb.format = FB_BGR888;

